## Final Project Submission

Please fill out:
* Student name:     Jennifer Lavoie
* Student pace:     self paced 
* Scheduled project review date/time: 
* Instructor name:  Jeff Herman 
* Blog post URL:

In [59]:
# Import necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [60]:
# This section of code begins reading in of all provided csv files to explore the available data in order to determine
# what questions might be able to be answered using this data.

In [61]:
# This section is for the import of the csv relating to IMDb data.

In [62]:
imdb_df1 = pd.read_csv('zippedData/imdb.name.basics.csv.gz')

#dropping the birth year and death year columns as do not intend to use these in analysis
imdb_df1.drop(['birth_year', 'death_year'], axis=1, inplace=True)

imdb_df1.head()

# This csv contains "nconst" which appears to be an ID to reference the professionals associated with movie titles 
# The titles are given also as an ID.

,nconst,primary_name,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [63]:
print(len(imdb_df1))

606648

In [64]:
imdb_df2 = pd.read_csv('zippedData/imdb.title.akas.csv.gz')

# dropping these two columns which I do not intend to use in analysis for simplicity and readability 
imdb_df2.drop(['attributes', 'types'], axis=1, inplace=True)

imdb_df2.head()

# This csv links movie titles with their ID, indicates the region of release, language of the movie and whether or not
# the title is the original title.  It appears that the language column contains a lot of NaNs and might not be very useful
# in analysis. 
# I won't be using this df any further for the analysis based on the questions I am asking.

,title_id,ordering,title,region,language,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,0.0
4,tt0369610,14,Jurassic World,FR,NaN,0.0

In [65]:
imdb_df3 = pd.read_csv('zippedData/imdb.title.basics.csv.gz')

imdb_df3.head()

# This csv links the title of the movie to it's ID as well, giving it the name "tconst."
# It also links it to a genre and gives information about the title the movie is known by v. original title. 
# It also links the title to its release year and length of the movie.

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [66]:
print(len(imdb_df3))

146144

In [67]:
imdb_df4 = pd.read_csv('zippedData/imdb.title.crew.csv.gz')

imdb_df4.head()

# This csv links the movie's ID, 'tconst' to the ID given in the first csv I imported from this set, identifying
# the writers and directors for the movie titles.

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [68]:
print(len(imdb_df4))

146144

In [69]:
imdb_df5 = pd.read_csv('zippedData/imdb.title.principals.csv.gz')

# dropping the characters column as I will not be using this in my analysis.  It linked actors to their characters
# in a particular movie ID and is NaN for everyone else.  
imdb_df5.drop('characters', axis=1, inplace=True)

imdb_df5.head()

# This csv links movie titles to various job titles, including actor, director, producer, etc.  It links again with
# "nconst." Names for "nconst" are linked in the first csv I read in on this project.

      tconst  ordering     nconst  category       job
0  tt0111414         1  nm0246005     actor       NaN
1  tt0111414         2  nm0398271  director       NaN
2  tt0111414         3  nm3739909  producer  producer
3  tt0323808        10  nm0059247    editor       NaN
4  tt0323808         1  nm3579312   actress       NaN

In [70]:
imdb_df6 = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')

imdb_df6.head()

# This csv links the average rating of a movie and the number of votes it received by "tconst" movie ID.

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [71]:
print(len(imdb_df6))

73856

In [72]:
# This section is the import of the csv for data from TheMovieDB.org

In [73]:
tmdb_df = pd.read_csv('zippedData/tmdb.movies.csv.gz')

# dropping the blank column inserted upon read-in of this csv
tmdb_df.drop('Unnamed: 0', axis=1, inplace=True)

tmdb_df.head()

# This csv gives information on a movie's ranking on this web site and the number of votes, as well as a popularity ranking.
# It also assigns an ID to the movie, which won't link to the IMDb ID, and it provies genre_ids, but does not 
# provide a way to decode to what genre those ids are linked.

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [74]:
print(len(tmdb_df))

26517

In [75]:
# This section is for the import of the csv relating to Box Office Mojo data

In [76]:
bom_df = pd.read_csv('zippedData/bom.movie_gross.csv.gz')

bom_df.head()

# This csv links a movie title to its domestic and foreign profit, as well as the year released.
# It provides an abbreviation for studio, but no key available to determine what they mean.

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [77]:
print(len(bom_df))

# This data only contains 3387 movies

3387

In [78]:
tn_df = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

tn_df.head()

# It is unclear which site this csv came from.  It links release date with movie title, production budget, and
# the domestic and worldwide gross of each movie.

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [79]:
print(len(tn_df))

# This data only contains 5782 movies.

5782

In [80]:
# This section is for the import of the Rotten Tomatoes data files

In [81]:
rt_df1 = pd.read_csv('zippedData/rt.movie_info.tsv.gz', sep='\t')

rt_df1.head()

# This file provies information on movie titles, including an ID that is assigned to each movie, but no movie title.

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [82]:
print(len(rt_df1))

1560

In [83]:
rt_df1['box_office'].isna().sum()

# checking to see how many of the movies are missing box_office values.  Was thinking of including these for questions
# involving revenue, but realized would not be able to match them up with other data as there is no ID in common
# and there is no key to establish what each of the IDs in this table equate to as far as movie title. Could use with
# revenue concerning directors, but would have no way to discount that I might be including a movie more than once in
# the analysis without being able to compare titles with the other data.

1220

In [84]:
# I did not import the text portion of the critic reviews as it created problems with the import and I had no need for 
# that information in this particular analysis.
rt_df2 = pd.read_csv('Data/rt.reviews.tsv', usecols = ['id','rating', 'fresh', 'critic', 
                   'top_critic', 'publisher', 'date'], sep='\t')
rt_df2.groupby('id') 

rt_df2.head()

# This data provides a link to the movie ID and it's ratings.  Each movie ID has more than one row associated with 
# a review from a different critic.

,id,rating,fresh,critic,top_critic,publisher,date
0,3,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [85]:
# Preparing the data to the mean of the ratings for each movie given that there are many movies that have NaN 
#values for ratings by particular critics.  The mean rating will be more informative. 
# The ratings are #/5 format, since the ratings are based on a 1-5 scale.  Splitting the data so that only the 
# rating remains. 
rt_df2['rating']= rt_df2['rating'].str.split("/", n = 1, expand = True) 

rt_df2.head()

,id,rating,fresh,critic,top_critic,publisher,date
0,3,3,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [86]:
# Removing Nan rows
rt_df2 = rt_df2[rt_df2['rating'].notna()]

rt_df2.head()

,id,rating,fresh,critic,top_critic,publisher,date
0,3,3,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
6,3,C,rotten,Eric D. Snider,0,EricDSnider.com,"July 17, 2013"
7,3,2,rotten,Matt Kelemen,0,Las Vegas CityLife,"April 21, 2013"
11,3,B-,fresh,Emanuel Levy,0,EmanuelLevy.Com,"February 3, 2013"
12,3,2,rotten,Christian Toto,0,Big Hollywood,"January 15, 2013"

In [87]:
#Noting that some of the ratings are letters rather than numbers, print a list of unique values found in the ratings

print(rt_df2['rating'].unique())

['3' 'C' '2' 'B-' 'B' '4' '6' '1' '8' '2.5' '2.0' '7' 'A-' '5' 'F' '3.5'
 'D+' '1.5' 'B+' '9' '7.5' '5.5' 'C-' 'C+' '0' '0.5' 'D' '3.1' '4.5' 'D-'
 'A+' 'A' '4.0' '9.5' '2.1' '6.5' '3.7' '8.4' '7.2' '2.2' '7.7' '5.0'
 '8.5' '3.0' '2.3' '8.6' '2.7' '4.2' '5.8' '7.1' 'N' 'R' '5.9' '2.4' '1.9'
 '4.9' '7.4' '8.8' '3.8' '6.8' '7.3' '7.0' '3.2' '6.3' '7.6' '8.1' '3.6'
 '1.8' '8.9' '8.2' '8.3' '2.6' '4.1' 'F+' '6.0' '1.0' '7.9' '8.7' '4.3'
 '9.6' '9.0' '1.7' '6.7' '8.0' '9.2' '5.2' '4.7' '6.2' '3.4' '9.7' '3.3'
 '4.8' '1.6' '1-5' '7.8' 'F-' '4.4' '6.9' 'T' '9.8' '3 1']

In [88]:
# This will remove all of the values found in the ratings column that are not numbers. 
letters = ['C', 'B-', 'B', 'A-', 'F', 'D+', 'B+', 'C-', 'C+', 'D', 'D-', 'A', 'A+', 'N', 'R', 'F+',
          'F-', 'T']

rt_df2 = rt_df2[~rt_df2['rating'].isin(letters)]

rt_df2.head()

print(rt_df2['rating'].unique())

['3' '2' '4' '6' '1' '8' '2.5' '2.0' '7' '5' '3.5' '1.5' '9' '7.5' '5.5'
 '0' '0.5' '3.1' '4.5' '4.0' '9.5' '2.1' '6.5' '3.7' '8.4' '7.2' '2.2'
 '7.7' '5.0' '8.5' '3.0' '2.3' '8.6' '2.7' '4.2' '5.8' '7.1' '5.9' '2.4'
 '1.9' '4.9' '7.4' '8.8' '3.8' '6.8' '7.3' '7.0' '3.2' '6.3' '7.6' '8.1'
 '3.6' '1.8' '8.9' '8.2' '8.3' '2.6' '4.1' '6.0' '1.0' '7.9' '8.7' '4.3'
 '9.6' '9.0' '1.7' '6.7' '8.0' '9.2' '5.2' '4.7' '6.2' '3.4' '9.7' '3.3'
 '4.8' '1.6' '1-5' '7.8' '4.4' '6.9' '9.8' '3 1']

In [89]:
# To take the mean of the ratings, need to convert them to float from str.  Some are decimals, need float not int.  
rt_df2['rating'] = pd.to_numeric(rt_df2['rating'],errors='coerce')

rt_df2.head()

,id,rating,fresh,critic,top_critic,publisher,date
0,3,3.0,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
7,3,2.0,rotten,Matt Kelemen,0,Las Vegas CityLife,"April 21, 2013"
12,3,2.0,rotten,Christian Toto,0,Big Hollywood,"January 15, 2013"
14,3,3.0,fresh,Marty Mapes,0,Movie Habit,"October 20, 2012"
15,3,3.0,fresh,Adam Ross,0,The Aristocrat,"September 27, 2012"

In [90]:
print(len(rt_df2))

34447

In [91]:
# Created a dataframe that gives only the ID of the movie and the mean rating of that movie

rt_df3 = rt_df2.groupby('id', as_index=False)['rating'].mean()
rt_df3 = rt_df3.rename(columns={'rating': 'mean_rating'})

rt_df3.head()

   id  mean_rating
0   3     3.303191
1   5     3.500000
2   6     2.987179
3   8     4.055556
4  10     2.722222

In [92]:
print(len(rt_df3))

1077

In [93]:
# With the data available, I will seek to answer the following 4 questions with this data:
#
# 1.  Does the size of the movie budget impact ratings awarded to the movie and do ratings have a relationship to 
#     the gross income of a movie? 
# 2.  Does the size of the movie budget impact the money made by the movie?
# 3.  Does choice of director for the movie appear to impact the gross income of a movie? 
# 4.  Do ratings have a relationship with who directs the movie?

In [94]:
# Code and Visualizations pertinent to answering Question 1

In [95]:
imdb_data = pd.merge(imdb_df3, imdb_df6, how = 'inner', left_on ='tconst', right_on ='tconst')

imdb_data.head()

# dataframe that combines the movie titles with their ratings for IMDb data.  This combindation dataframe can be used
# for both questions 1 and 4.  Inner join provides for only those movies that appear in both tables.  (want dataframe
# of only movies that have ratings associated with them.)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

In [96]:
print(len(imdb_data))

# The length of this dataframe is less than df3 and the same as df6 since this will only include movies that 
# have a rating score on IMDb.  This dataframe can be used to answer the question pertaining to budget effect
# on ratings.

73856

In [97]:
# Discussion Concerning Question 1:
#

In [98]:
# Code and Visualizations pertinent to answering Question 2

In [99]:
# Discussion Concerning Question 2:

In [100]:
# Code and Visualizations pertinent to answering Question 3

In [101]:
imdb_directors = pd.merge(imdb_df1, imdb_df4, how='inner', left_on = 'nconst', right_on = 'directors')

# dropping unnecessary columns.  
imdb_directors.drop(['writers', 'known_for_titles', 'primary_profession'], axis=1, inplace=True)

imdb_directors.head()

# This dataframe will connect the name of the director to the movie ID.

      nconst    primary_name     tconst  directors
0  nm0062879  Ruel S. Bayani  tt1592569  nm0062879
1  nm0062879  Ruel S. Bayani  tt8421806  nm0062879
2  nm0062879  Ruel S. Bayani  tt2057445  nm0062879
3  nm0062879  Ruel S. Bayani  tt2590280  nm0062879
4  nm0064023   Bryan Beasley  tt4512140  nm0064023

In [102]:
print(len(imdb_directors))

124689

In [103]:
director_movie_data = pd.merge(imdb_df3, imdb_directors, how = 'inner', left_on = 'tconst', right_on = 'tconst')

# Rename this column to better indicate what the column refers to in this combined dataframe.
director_movie_data = director_movie_data.rename(columns={'primary_name': 'director_name'})

director_movie_data.head()

# This dataframe combines the IMDb data for all the movie titles with their director.  This can later be combined with 
# profit information to determine who the directors are for the movies with the most profit.  Use for Question 3 and
# use with question 4 (need also imdb_df6 for that question).

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,nconst,director_name,directors
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0712540,Harnam Singh Rawail,nm0712540
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",nm0002411,Mani Kaul,nm0002411
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,nm0000080,Orson Welles,nm0000080
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",nm0611531,Hrishikesh Mukherjee,nm0611531
4,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,nm0398271,Frank Howson,nm0398271

In [104]:
print(len(director_movie_data))

# Length of this data reduces total movies by number of movies with available director data.

124689

In [105]:
combined_bom_tn = pd.merge(bom_df, tn_df, left_on='title', right_on = 'movie', how='outer', indicator=True)

combined_bom_tn

# Merged both bom and tn df to see how many movies are common to both.  Adding the lengths of both dataframes, 
# it is known that before joining, there were 9169 movie titles between them.

,title,studio,domestic_gross_x,foreign_gross,year,id,release_date,movie,production_budget,domestic_gross_y,worldwide_gross,_merge
0,Toy Story 3,BV,415000000.0,652000000,2010.0,47.0,"Jun 18, 2010",Toy Story 3,"$200,000,000","$415,004,880","$1,068,879,522",both
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010.0,NaN,NaN,NaN,NaN,NaN,NaN,left_only
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010.0,NaN,NaN,NaN,NaN,NaN,NaN,left_only
3,Inception,WB,292600000.0,535700000,2010.0,38.0,"Jul 16, 2010",Inception,"$160,000,000","$292,576,195","$835,524,642",both
4,Shrek Forever After,P/DW,238700000.0,513900000,2010.0,27.0,"May 21, 2010",Shrek Forever After,"$165,000,000","$238,736,787","$756,244,673",both
...,...,...,...,...,...,...,...,...,...,...,...,...
7926,NaN,NaN,NaN,NaN,NaN,78.0,"Dec 31, 2018",Red 11,"$7,000",$0,$0,right_only
7927,NaN,NaN,NaN,NaN,NaN,79.0,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495",right_only
7928,NaN,NaN,NaN,NaN,NaN,80.0,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338",right_only
7929,NaN,NaN,NaN,NaN,NaN,81.0,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0,right_only
7930,NaN,NaN,NaN,NaN,NaN,82.0,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041",right_only

In [106]:
print(len(combined_bom_tn))

# This dataframe contains 7931, which means that 1238 of them must be shared between both dataframes.

7931

In [107]:
profit_bom = pd.merge(director_data, bom_df, how='inner', left_on = 'primary_title', right_on = 'title')
profit_bom.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,nconst,director_name,directors,title,studio,domestic_gross,foreign_gross,year
0,tt0315642,Wazir,Wazir,2016,103.0,"Action,Crime,Drama",nm2349060,Bejoy Nambiar,nm2349060,Wazir,Relbig.,1100000.0,NaN,2016
1,tt0337692,On the Road,On the Road,2012,124.0,"Adventure,Drama,Romance",nm0758574,Walter Salles,nm0758574,On the Road,IFC,744000.0,8000000,2012
2,tt2404548,On the Road,On the Road,2011,90.0,Drama,nm5281451,Harutyun Azaryan,nm5281451,On the Road,IFC,744000.0,8000000,2012
3,tt3872966,On the Road,On the Road,2013,87.0,Documentary,nm4953104,Marvin Dau,nm4953104,On the Road,IFC,744000.0,8000000,2012
4,tt4339118,On the Road,On the Road,2014,89.0,Drama,nm7042169,Poong-ki Kim,nm7042169,On the Road,IFC,744000.0,8000000,2012

In [108]:
# Discussion Concerning Question 3:
#

In [109]:
budget = pd.merge(profit_bom, tn_df, how='inner',left_on='primary_title',right_on='movie')
budget.drop('domestic_gross_x', axis=1, inplace=True) # dropping the column with rounded domestic gross
budget = budget.rename(columns={'domestic_gross_y': 'domestic_gross'}) # rename unrounded column after dropping duplicate
budget.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,nconst,director_name,directors,title,studio,foreign_gross,year,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,tt0337692,On the Road,On the Road,2012,124.0,"Adventure,Drama,Romance",nm0758574,Walter Salles,nm0758574,On the Road,IFC,8000000,2012,17,"Mar 22, 2013",On the Road,"$25,000,000","$720,828","$9,313,302"
1,tt2404548,On the Road,On the Road,2011,90.0,Drama,nm5281451,Harutyun Azaryan,nm5281451,On the Road,IFC,8000000,2012,17,"Mar 22, 2013",On the Road,"$25,000,000","$720,828","$9,313,302"
2,tt3872966,On the Road,On the Road,2013,87.0,Documentary,nm4953104,Marvin Dau,nm4953104,On the Road,IFC,8000000,2012,17,"Mar 22, 2013",On the Road,"$25,000,000","$720,828","$9,313,302"
3,tt4339118,On the Road,On the Road,2014,89.0,Drama,nm7042169,Poong-ki Kim,nm7042169,On the Road,IFC,8000000,2012,17,"Mar 22, 2013",On the Road,"$25,000,000","$720,828","$9,313,302"
4,tt5389486,On the Road,On the Road,2015,39.0,Documentary,nm5449087,Maxim Sliussarev,nm5449087,On the Road,IFC,8000000,2012,17,"Mar 22, 2013",On the Road,"$25,000,000","$720,828","$9,313,302"

In [110]:
rt_data = pd.merge(rt_df1, rt_df3, how='inner',left_on='id',right_on='id')

# dropping these columns for readability and simplicity.  Won't use in analysis.
rt_data.drop(['currency', 'synopsis'], axis=1, inplace=True) 

rt_data.head()

,id,rating,genre,director,writer,theater_date,dvd_date,box_office,runtime,studio,mean_rating
0,3,R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013","600,000",108 minutes,Entertainment One,3.303191
1,5,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,116 minutes,NaN,3.500000
2,6,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,128 minutes,NaN,2.987179
3,8,PG,Drama|Kids and Family,Jay Russell,Gail Gilchriest,"Mar 3, 2000","Jul 11, 2000",NaN,95 minutes,Warner Bros. Pictures,4.055556
4,10,PG-13,Comedy,Jake Kasdan,Mike White,"Jan 11, 2002","Jun 18, 2002","41,032,915",82 minutes,Paramount Pictures,2.722222